Конфигурация/DataProcessors/ИмпортЕкспортНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортЕкспортНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>м</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/ИмпортЕкспортНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка значений по умолчанию
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыбратьФайлНоменклатуры(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл номенклатуры (Excel)";
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлуНоменклатуры = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлШтрихкодов(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл штрихкодов (Excel)";
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлуШтрихкодов = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлЦен(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл цен (Excel)";
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлуЦен = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлОстатков(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл остатков (Excel)";
	ДиалогВыбора.Фильтр = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлуОстатков = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьИмпорт(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлуНоменклатуры) Тогда
		ПоказатьПредупреждение(, "Выберите файл номенклатуры");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКФайлуЦен) И Не ЗначениеЗаполнено(ТипЦен) Тогда
		ПоказатьПредупреждение(, "Выберите тип цен для загрузки");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКФайлуОстатков) И Не ЗначениеЗаполнено(Склад) Тогда
		ПоказатьПредупреждение(, "Выберите склад для загрузки остатков");
		Возврат;
	КонецЕсли;
	
	Результат = Ждать ВопросАсинх("Выполнить импорт номенклатуры из Excel?", 
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		РезультатИмпорта = ВыполнитьИмпортНаСервере();
		ПоказатьПредупреждение(, РезультатИмпорта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьИмпортНаСервере()
	
	КоличествоИмпортировано = 0;
	КоличествоОшибок = 0;
	СообщенияОшибок = Новый Массив;
	
	// Загрузка штрихкодов в соответствие (Код товара -> Массив штрихкодов)
	СоответствиеШтрихкодов = Новый Соответствие;
	Если ЗначениеЗаполнено(ПутьКФайлуШтрихкодов) Тогда
		СоответствиеШтрихкодов = ЗагрузитьШтрихкодыИзExcel(ПутьКФайлуШтрихкодов);
	КонецЕсли;
	
	// Загрузка номенклатуры
	Попытка
		ТаблицаНоменклатуры = ПрочитатьExcelФайл(ПутьКФайлуНоменклатуры);
	Исключение
		Возврат "Ошибка чтения файла номенклатуры: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		Возврат "Файл номенклатуры пуст или имеет неверный формат";
	КонецЕсли;
	
	// Сначала создаём группы (родителей)
	СоответствиеГрупп = СоздатьГруппыНоменклатуры(ТаблицаНоменклатуры);
	
	// Соответствие Код -> СсылкаНоменклатуры
	СоответствиеНоменклатуры = Новый Соответствие;
	
	// Затем создаём элементы
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
		
		Попытка
			СсылкаНоменклатуры = СоздатьИлиОбновитьНоменклатуру(СтрокаТаблицы, СоответствиеГрупп, СоответствиеШтрихкодов);
			
			// Сохраняем ссылку для загрузки цен и остатков
			Если СсылкаНоменклатуры <> Неопределено Тогда
				СоответствиеНоменклатуры.Вставить(СтрокаТаблицы.Код, СсылкаНоменклатуры);
			КонецЕсли;
			
			КоличествоИмпортировано = КоличествоИмпортировано + 1;
		Исключение
			КоличествоОшибок = КоличествоОшибок + 1;
			СообщенияОшибок.Добавить(СтрШаблон("Код %1: %2", СтрокаТаблицы.Код, ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЦикла;
	
	// Загрузка цен из отдельного файла
	КоличествоЦен = 0;
	Если ЗначениеЗаполнено(ПутьКФайлуЦен) И ЗначениеЗаполнено(ТипЦен) Тогда
		Попытка
			СоответствиеЦен = ЗагрузитьЦеныИзExcel(ПутьКФайлуЦен);
			КоличествоЦен = ЗаписатьЦеныВРегистр(СоответствиеНоменклатуры, СоответствиеЦен);
		Исключение
			СообщенияОшибок.Добавить("Ошибка загрузки цен: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	// Загрузка остатков из отдельного файла
	КоличествоОстатков = 0;
	Если ЗначениеЗаполнено(ПутьКФайлуОстатков) И ЗначениеЗаполнено(Склад) Тогда
		Попытка
			СоответствиеОстатков = ЗагрузитьОстаткиИзExcel(ПутьКФайлуОстатков);
			КоличествоОстатков = ЗаписатьОстаткиВРегистр(СоответствиеНоменклатуры, СоответствиеОстатков);
		Исключение
			СообщенияОшибок.Добавить("Ошибка загрузки остатков: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Результат = СтрШаблон("Импорт завершён. Номенклатуры: %1, Цен: %2, Остатков: %3, Ошибок: %4", 
		КоличествоИмпортировано, КоличествоЦен, КоличествоОстатков, КоличествоОшибок);
	
	Если СообщенияОшибок.Количество() > 0 И СообщенияОшибок.Количество() <= 10 Тогда
		Результат = Результат + Символы.ПС + Символы.ПС + "Ошибки:" + Символы.ПС + СтрСоединить(СообщенияОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаписатьЦеныВРегистр(СоответствиеНоменклатуры, СоответствиеЦен)
	
	КоличествоЗаписей = 0;
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	Для Каждого КлючИЗначение Из СоответствиеЦен Цикл
		
		КодТовара = КлючИЗначение.Ключ;
		Цена = КлючИЗначение.Значение;
		
		Если Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаНоменклатуры = СоответствиеНоменклатуры.Получить(КодТовара);
		Если СсылкаНоменклатуры = Неопределено Тогда
			// Попробуем найти по коду в справочнике
			СсылкаНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
			Если СсылкаНоменклатуры.Пустая() Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Очищаем старые записи для этой номенклатуры и типа цен
		НаборЗаписей.Отбор.Номенклатура.Установить(СсылкаНоменклатуры);
		НаборЗаписей.Отбор.ТипЦен.Установить(ТипЦен);
		НаборЗаписей.Прочитать();
		
		// Добавляем новую запись
		НаборЗаписей.Очистить();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.Номенклатура = СсылкаНоменклатуры;
		НоваяЗапись.ТипЦен = ТипЦен;
		НоваяЗапись.Цена = Цена;
		
		НаборЗаписей.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервере
Функция ЗаписатьОстаткиВРегистр(СоответствиеНоменклатуры, СоответствиеОстатков)
	
	КоличествоЗаписей = 0;
	
	Для Каждого КлючИЗначение Из СоответствиеОстатков Цикл
		
		КодТовара = КлючИЗначение.Ключ;
		НужныйОстаток = КлючИЗначение.Значение;
		
		Если НужныйОстаток = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаНоменклатуры = СоответствиеНоменклатуры.Получить(КодТовара);
		Если СсылкаНоменклатуры = Неопределено Тогда
			// Попробуем найти по коду в справочнике
			СсылкаНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
			Если СсылкаНоменклатуры.Пустая() Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Получаем текущий остаток
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК ТекущийОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад И Номенклатура = &Номенклатура) КАК ОстаткиТоваровОстатки";
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Номенклатура", СсылкаНоменклатуры);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТекущийОстаток = 0;
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущийОстаток = Выборка.ТекущийОстаток;
			КонецЕсли;
		КонецЕсли;
		
		// Разница = нужный остаток - текущий остаток
		Разница = НужныйОстаток - ТекущийОстаток;
		
		Если Разница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Создаём запись в регистре без регистратора (независимая запись)
		МенеджерЗаписи = РегистрыНакопления.ОстаткиТоваров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Номенклатура = СсылкаНоменклатуры;
		МенеджерЗаписи.Количество = Разница;
		
		Если Разница > 0 Тогда
			МенеджерЗаписи.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			МенеджерЗаписи.ВидДвижения = ВидДвиженияНакопления.Расход;
			МенеджерЗаписи.Количество = -Разница;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

&НаСервере
Функция ЗагрузитьЦеныИзExcel(ПутьКФайлу)
	
	СоответствиеЦен = Новый Соответствие;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ПутьКФайлу);
	
	// Определяем колонки
	КолонкаКодТовара = 0;
	КолонкаЦена = 0;
	
	Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ЗначениеЯчейки = НРег(СокрЛП(ТабличныйДокумент.Область(1, Колонка).Текст));
		
		Если СтрНайти(ЗначениеЯчейки, "код") > 0 Тогда
			КолонкаКодТовара = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "цена") > 0 Тогда
			КолонкаЦена = Колонка;
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкаКодТовара = 0 Или КолонкаЦена = 0 Тогда
		Возврат СоответствиеЦен;
	КонецЕсли;
	
	// Читаем данные
	Для Строка = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		КодТовара = СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаКодТовара).Текст);
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Цена = Число(СтрЗаменить(ТабличныйДокумент.Область(Строка, КолонкаЦена).Текст, ",", "."));
			СоответствиеЦен.Вставить(КодТовара, Цена);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат СоответствиеЦен;
	
КонецФункции

&НаСервере
Функция ЗагрузитьОстаткиИзExcel(ПутьКФайлу)
	
	СоответствиеОстатков = Новый Соответствие;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ПутьКФайлу);
	
	// Определяем колонки
	КолонкаКодТовара = 0;
	КолонкаОстаток = 0;
	
	Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ЗначениеЯчейки = НРег(СокрЛП(ТабличныйДокумент.Область(1, Колонка).Текст));
		
		Если СтрНайти(ЗначениеЯчейки, "код") > 0 Тогда
			КолонкаКодТовара = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "остаток") > 0 Или СтрНайти(ЗначениеЯчейки, "количество") > 0 Тогда
			КолонкаОстаток = Колонка;
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкаКодТовара = 0 Или КолонкаОстаток = 0 Тогда
		Возврат СоответствиеОстатков;
	КонецЕсли;
	
	// Читаем данные
	Для Строка = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		КодТовара = СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаКодТовара).Текст);
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Остаток = Число(СтрЗаменить(ТабличныйДокумент.Область(Строка, КолонкаОстаток).Текст, ",", "."));
			СоответствиеОстатков.Вставить(КодТовара, Остаток);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат СоответствиеОстатков;
	
КонецФункции

&НаСервере
Функция ПрочитатьExcelФайл(ПутьКФайлу)
	
	ТаблицаДанных = Новый Массив;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ПутьКФайлу);
	
	// Определяем колонки по заголовкам в первой строке
	КолонкаКод = 0;
	КолонкаНаименование = 0;
	КолонкаНаЭтикетке = 0;
	КолонкаЕдИзмерения = 0;
	КолонкаКодРодитель = 0;
	КолонкаНаименованиеРодитель = 0;
	
	// Читаем заголовки
	Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ЗначениеЯчейки = НРег(СокрЛП(ТабличныйДокумент.Область(1, Колонка).Текст));
		
		Если СтрНайти(ЗначениеЯчейки, "код") > 0 И СтрНайти(ЗначениеЯчейки, "родител") = 0 Тогда
			КолонкаКод = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "наименование") > 0 И СтрНайти(ЗначениеЯчейки, "родител") = 0 Тогда
			КолонкаНаименование = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "этикет") > 0 Тогда
			КолонкаНаЭтикетке = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "ед") > 0 И СтрНайти(ЗначениеЯчейки, "изм") > 0 Тогда
			КолонкаЕдИзмерения = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "код") > 0 И СтрНайти(ЗначениеЯчейки, "родител") > 0 Тогда
			КолонкаКодРодитель = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "наименование") > 0 И СтрНайти(ЗначениеЯчейки, "родител") > 0 Тогда
			КолонкаНаименованиеРодитель = Колонка;
		КонецЕсли;
	КонецЦикла;
	
	// Читаем данные начиная со второй строки
	Для Строка = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Код = "";
		Если КолонкаКод > 0 Тогда
			Код = СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаКод).Текст);
		КонецЕсли;
		
		// Пропускаем пустые строки
		Если Не ЗначениеЗаполнено(Код) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Код", Код);
		ДанныеСтроки.Вставить("Наименование", ?(КолонкаНаименование > 0, СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаНаименование).Текст), ""));
		ДанныеСтроки.Вставить("НаЭтикетке", ?(КолонкаНаЭтикетке > 0, СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаНаЭтикетке).Текст), ""));
		ДанныеСтроки.Вставить("ЕдиницаИзмерения", ?(КолонкаЕдИзмерения > 0, СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаЕдИзмерения).Текст), ""));
		ДанныеСтроки.Вставить("КодРодитель", ?(КолонкаКодРодитель > 0, СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаКодРодитель).Текст), ""));
		ДанныеСтроки.Вставить("НаименованиеРодитель", ?(КолонкаНаименованиеРодитель > 0, СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаНаименованиеРодитель).Текст), ""));
		
		ТаблицаДанных.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаСервере
Функция ЗагрузитьШтрихкодыИзExcel(ПутьКФайлу)
	
	СоответствиеШтрихкодов = Новый Соответствие;
	
	Попытка
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Прочитать(ПутьКФайлу);
	Исключение
		Возврат СоответствиеШтрихкодов;
	КонецПопытки;
	
	// Определяем колонки
	КолонкаКодТовара = 0;
	КолонкаШтрихкод = 0;
	
	Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ЗначениеЯчейки = НРег(СокрЛП(ТабличныйДокумент.Область(1, Колонка).Текст));
		
		Если СтрНайти(ЗначениеЯчейки, "код") > 0 И СтрНайти(ЗначениеЯчейки, "товар") > 0 Тогда
			КолонкаКодТовара = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "код") > 0 И КолонкаКодТовара = 0 Тогда
			КолонкаКодТовара = Колонка;
		ИначеЕсли СтрНайти(ЗначениеЯчейки, "штрих") > 0 Тогда
			КолонкаШтрихкод = Колонка;
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкаКодТовара = 0 Или КолонкаШтрихкод = 0 Тогда
		Возврат СоответствиеШтрихкодов;
	КонецЕсли;
	
	// Читаем данные
	Для Строка = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		КодТовара = СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаКодТовара).Текст);
		Штрихкод = СокрЛП(ТабличныйДокумент.Область(Строка, КолонкаШтрихкод).Текст);
		
		Если Не ЗначениеЗаполнено(КодТовара) Или Не ЗначениеЗаполнено(Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивШтрихкодов = СоответствиеШтрихкодов.Получить(КодТовара);
		Если МассивШтрихкодов = Неопределено Тогда
			МассивШтрихкодов = Новый Массив;
			СоответствиеШтрихкодов.Вставить(КодТовара, МассивШтрихкодов);
		КонецЕсли;
		
		МассивШтрихкодов.Добавить(Штрихкод);
		
	КонецЦикла;
	
	Возврат СоответствиеШтрихкодов;
	
КонецФункции

&НаСервере
Функция СоздатьГруппыНоменклатуры(ТаблицаНоменклатуры)
	
	// Собираем уникальные группы
	СоответствиеГрупп = Новый Соответствие; // КодРодитель -> СсылкаНаГруппу
	
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
		
		КодРодитель = СтрокаТаблицы.КодРодитель;
		НаименованиеРодитель = СтрокаТаблицы.НаименованиеРодитель;
		
		Если Не ЗначениеЗаполнено(КодРодитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоответствиеГрупп.Получить(КодРодитель) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем группу по коду
		СсылкаГруппы = Справочники.Номенклатура.НайтиПоКоду(КодРодитель);
		
		Если СсылкаГруппы.Пустая() Тогда
			// Создаём группу
			НачатьТранзакцию();
			Попытка
				ГруппаОбъект = Справочники.Номенклатура.СоздатьГруппу();
				ГруппаОбъект.Код = КодРодитель;
				ГруппаОбъект.Наименование = ?(ЗначениеЗаполнено(НаименованиеРодитель), НаименованиеРодитель, КодРодитель);
				ГруппаОбъект.Записать();
				СсылкаГруппы = ГруппаОбъект.Ссылка;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
		КонецЕсли;
		
		СоответствиеГрупп.Вставить(КодРодитель, СсылкаГруппы);
		
	КонецЦикла;
	
	Возврат СоответствиеГрупп;
	
КонецФункции

&НаСервере
Функция СоздатьИлиОбновитьНоменклатуру(ДанныеНоменклатуры, СоответствиеГрупп, СоответствиеШтрихкодов)
	
	// Поиск существующего элемента по коду
	СсылкаНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(ДанныеНоменклатуры.Код);
	
	НачатьТранзакцию();
	Попытка
		
		Если СсылкаНоменклатуры.Пустая() Тогда
			ОбъектНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
			ОбъектНоменклатуры.Код = ДанныеНоменклатуры.Код;
		Иначе
			ОбъектНоменклатуры = СсылкаНоменклатуры.ПолучитьОбъект();
		КонецЕсли;
		
		// Заполнение реквизитов
		ОбъектНоменклатуры.Наименование = ДанныеНоменклатуры.Наименование;
		
		// Родитель
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.КодРодитель) Тогда
			РодительСсылка = СоответствиеГрупп.Получить(ДанныеНоменклатуры.КодРодитель);
			Если РодительСсылка <> Неопределено И Не РодительСсылка.Пустая() Тогда
				ОбъектНоменклатуры.Родитель = РодительСсылка;
			КонецЕсли;
		КонецЕсли;
		
		// Единица измерения
		ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(ДанныеНоменклатуры.ЕдиницаИзмерения);
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ОбъектНоменклатуры.ЕдиницаИзмерения = ЕдиницаИзмерения;
		КонецЕсли;
		
		// Штрихкоды
		МассивШтрихкодов = СоответствиеШтрихкодов.Получить(ДанныеНоменклатуры.Код);
		Если МассивШтрихкодов <> Неопределено Тогда
			ОбъектНоменклатуры.Штрихкоды.Очистить();
			Для Каждого Штрихкод Из МассивШтрихкодов Цикл
				НоваяСтрока = ОбъектНоменклатуры.Штрихкоды.Добавить();
				НоваяСтрока.Штрихкод = Лев(Штрихкод, 200);
			КонецЦикла;
		КонецЕсли;
		
		ОбъектНоменклатуры.Записать();
		СсылкаНоменклатуры = ОбъектНоменклатуры.Ссылка;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат СсылкаНоменклатуры;
	
КонецФункции

&НаСервере
Функция ПолучитьЕдиницуИзмерения(СтроковоеЗначение)
	
	Если Не ЗначениеЗаполнено(СтроковоеЗначение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтроковоеЗначениеНижний = НРег(СокрЛП(СтроковоеЗначение));
	
	Если СтрНайти(СтроковоеЗначениеНижний, "кг") > 0 Тогда
		Возврат Перечисления.ЕдиницыИзмерения.кг;
	ИначеЕсли СтрНайти(СтроковоеЗначениеНижний, "шт") > 0 Тогда
		Возврат Перечисления.ЕдиницыИзмерения.шт;
	ИначеЕсли СтроковоеЗначениеНижний = "л" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.л;
	ИначеЕсли СтроковоеЗначениеНижний = "м" Тогда
		Возврат Перечисления.ЕдиницыИзмерения.м;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
